bahadiryildirimeem/PCA9685-Driver/Implementation/MIMXRT1011_Project_PCA9685Driver_Example/source/MIMXRT1011_Project_examples.c
/*
 * Copyright 2016-2021 NXP
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of NXP Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/**
 * @file    MIMXRT1011_Project_mer.c
 * @brief   Application entry point.
 */
#include <stdio.h>
#include "board.h"
#include "peripherals.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "MIMXRT1011.h"
/* TODO: insert other include files here. */

/* TODO: insert other definitions and declarations here. */
#include "PCA9685_Driver/PCA9685.h"
#include "PCA9685_Driver/examples.h"

/*
 * @brief   Application entry point.
 */
int main(void) {

    /* Init board hardware. */
    BOARD_ConfigMPU();
    BOARD_InitBootPins();
    BOARD_InitBootClocks();
    LPI2C_MasterGetDefaultConfig(&LPI2C1_masterConfig);
    LPI2C1_masterConfig.baudRate_Hz = 200000;
    BOARD_InitBootPeripherals();
    uint32_t counter1 = 0;
    uint8_t toggState = 0;

    /* Force the counter to be placed into memory. */
    volatile static int i = 0 ;
    /* Enter an infinite loop, just incrementing a counter. */

    counter1 = 0;
    uint8_t example = EXAMPLE_FADING_EFFECT;
    examplesInit[example]();
    uint16_t counter2 = 0;
    while(1) {
    	counter1++;
    	if(counter1 > 800000)
    	{
    		toggState ^= 1;
    		counter1 = 0;
    		examplesRun[example]();
    		counter2 += 100;
    		if(counter2 > 4095)
    		{
    			counter2 = 0;
    		}
    	}
    	if(toggState == 0)
    	{
    		GPIO_PinWrite(GPIO1, 11, true);
    	}
    	else
    	{
    		GPIO_PinWrite(GPIO1, 11, false);
    	}
        i++ ;
        /* 'Dummy' NOP to allow source level single stepping of
            tight while() loop */
        __asm volatile ("nop");
    }
    return 0 ;
}
